def area(a, b): 
    ''' 
    Функция находит площадь прямоугольника

         Параметры:
             a: первое число - сторона прямоугольника
             b: второе число - другая сторона прямоугольника
         Возвращаемое значение:
              a * b: площадь прямоугольника.
     '''
    return a * b


def perimeter(a, b): 
    ''' 
    Функция находит периметр прямоугольника
    
         Параметры:
             a: первое число - сторона прямоугольника
             b: второе число - другая сторона прямоугольника
         Возвращаемое значение:
              (a + b) * 2: периметр прямоугольника.
     '''
    return (a + b) * 2