def area(a, h): 
    ''' 
    Функция находит площадь треугольника

         Параметры:
             a: первое число - сторона треугольника
             b: второе число - другая сторона треугольника
         Возвращаемое значение:
              a * h / 2: площадь треугольника.
     '''
    return a * h / 2


def perimeter(a, b, c): 
    ''' 
    Функция находит периметр треугольника

         Параметры:
             a: первое число - сторона треугольника
             b: второе число - другая сторона треугольника
         Возвращаемое значение:
              a + b + c: периметр треугольника.
     '''
    return a + b + c